SampleCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "7";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
24400
(
(-0.0183522 0.0163001 -1.3023e-19)
(-0.0294451 0.0316884 2.7358e-19)
(-0.0156538 0.0384186 2.62871e-19)
(0.0231786 0.0397824 -2.51448e-19)
(0.0872769 0.0378295 -1.17601e-19)
(0.17652 0.0339191 -3.34477e-19)
(0.289801 0.0290356 0)
(0.424134 0.0238252 0)
...
)
;

boundaryField
{
    out
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           nonuniform List<vector> 
120
(
(0.684394 -0.205569 -1.54433e-23)
(0.685447 -0.204445 1.54442e-23)
(0.687201 -0.203398 -2.9697e-23)
(0.689643 -0.20242 2.96893e-23)
(0.692756 -0.201499 0)
(0.696526 -0.20062 4.76766e-23)
(0.700934 -0.19977 -5.63828e-23)
(0.705963 -0.19893 -9.11632e-23)
...
)
;
    }
    sym1
    {
        type            symmetryPlane;
    }
    sym2
    {
        type            symmetryPlane;
    }
    in
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    cylinder
    {
        type            noSlip;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
