SampleCase/0/pMean
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "7";
    object      pMean;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
24400
(
-0.391692
-0.389391
-0.386111
-0.382289
-0.378268
-0.374243
-0.370222
-0.366022
...
)
;

boundaryField
{
    out
    {
        type            calculated;
        value           uniform 0;
    }
    sym1
    {
        type            symmetryPlane;
    }
    sym2
    {
        type            symmetryPlane;
    }
    in
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.0836185
0.0836115
0.0835976
0.083577
0.0835495
0.0835153
0.0834744
0.0834267
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.391692
-0.396483
-0.401847
-0.407806
-0.414374
-0.421558
-0.42936
-0.437771
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
