SampleCase/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "7";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
48410
(
2.13782e-07
1.68153e-05
-1.70291e-05
4.12828e-06
2.88584e-05
-3.27729e-05
1.4397e-05
2.27121e-05
...
)
;

boundaryField
{
    out
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.000725757
0.000726936
0.000728857
0.000731506
0.000734865
0.000738917
0.000743644
0.000749025
...
)
;
    }
    sym1
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    sym2
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    in
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
-0.00106066
-0.00106066
-0.00106066
-0.00106066
-0.00106066
-0.00106066
-0.00106066
-0.00106066
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            empty;
        value           nonuniform 0();
    }
    front
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
